tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mongodb/brew"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c", link: true
# Vector graphics library with cross-device output support
brew "cairo"
# C library implementing the SSH2 protocol
brew "libssh2"
# Generic library support script
brew "libtool"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# General-purpose scripting language
brew "php", restart_service: true
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Manage compile and link flags for libraries
brew "pkg-config"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Control devices with TV remote control and HDMI cabling
brew "libcec"
# YAML Parser
brew "libyaml"
# Next-gen compiler infrastructure
brew "llvm"
# Platform built on V8 to build network applications
brew "node"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# GDI+-compatible API on non-Windows operating systems
brew "mono-libgdiplus"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Simple CLI for interacting with Google oauth tokens
brew "oauth2l"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Python version management
brew "pyenv"
# Command-line YAML and XML processor that wraps jq
brew "python-yq"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Image processing library
brew "vips"
# Tool for creating isolated virtual python environments
brew "virtualenv", link: false
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# OpenJDK distribution from Azul
cask "zulu17"
vscode "076923.python-image-preview"
vscode "1yib.rust-bundle"
vscode "adpyke.codesnap"
vscode "adrianwilczynski.alpine-js-intellisense"
vscode "afractal.node-essentials"
vscode "aki77.rails-db-schema"
vscode "aki77.rails-routes"
vscode "alexcvzz.vscode-sqlite"
vscode "alexisvt.flutter-snippets"
vscode "aliariff.vscode-erb-beautify"
vscode "amandeepmittal.pug"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "amlovey.shaderlabvscodefree"
vscode "andys8.jest-snippets"
vscode "animus-coop.vscode-elixir-mix-formatter"
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "ardenivanov.svelte-intellisense"
vscode "austenc.tailwind-docs"
vscode "batisteo.vscode-django"
vscode "be5invis.vscode-icontheme-nomo-dark"
vscode "bencoleman.armview"
vscode "bibhasdn.django-html"
vscode "bibhasdn.django-snippets"
vscode "bierner.markdown-emoji"
vscode "bigonesystems.django"
vscode "bmewburn.vscode-intelephense-client"
vscode "bourhaouta.tailwindshades"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "bungcip.better-toml"
vscode "burkeholland.simple-react-snippets"
vscode "bycedric.vscode-expo"
vscode "chris-noring.node-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "conch.csharp-convert-ts"
vscode "craigmaslowski.erb"
vscode "csharpier.csharpier-vscode"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "did1335.opencv-intellisense"
vscode "diemasmichiels.emulate"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "elia.erb-formatter"
vscode "elliotekj.elixir-mix-format"
vscode "eppz.eppz-code"
vscode "equimper.react-native-react-redux"
vscode "esafirm.kotlin-formatter"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "gamunu.vscode-yarn"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gornivv.vscode-flutter-files"
vscode "groksrc.ruby"
vscode "gsgupta.opencv-snippets"
vscode "hediet.vscode-drawio"
vscode "hirantha.json-to-dart"
vscode "hridoy.rails-snippets"
vscode "humao.rest-client"
vscode "hyeon.c-math-viewer"
vscode "ijs.emotionsnippets"
vscode "ionide.ionide-fsharp"
vscode "itarato.byesig"
vscode "iulian-radu-at.find-unused-exports"
vscode "jakebecker.elixir-ls"
vscode "jasonnutter.search-node-modules"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "jnbt.vscode-rufo"
vscode "johnpapa.vscode-peacock"
vscode "juanblanco.solidity"
vscode "jundat95.react-native-snippet"
vscode "kevinrose.vsc-python-indent"
vscode "kleber-swf.unity-code-snippets"
vscode "koichisasada.vscode-rdbg"
vscode "luanpotter.dart-import"
vscode "magicstack.magicpython"
vscode "marcelovelasquez.flutter-tree"
vscode "mathiasfrohlich.kotlin"
vscode "max-ss.cyberpunk"
vscode "maxchamps.django-commands"
vscode "mgesbert.python-path"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "moppitz.vscode-extension-auto-import"
vscode "mquandalle.graphql"
vscode "mrmlnc.vscode-jade-snippets"
vscode "mrmlnc.vscode-scss"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.js-atom-grammar"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-vsliveshare.vsliveshare"
vscode "msazurermtools.azurerm-vscode-tools"
vscode "msjsdiag.debugger-for-chrome"
vscode "msjsdiag.vscode-react-native"
vscode "mubaidr.vuejs-extension-pack"
vscode "muhajirframe.vscode-react-emotion"
vscode "nash.awesome-flutter-snippets"
vscode "njpwerner.autodocstring"
vscode "noku.rails-run-spec-vscode"
vscode "nucllear.vscode-extension-auto-import"
vscode "octref.vetur"
vscode "onecentlin.laravel-blade"
vscode "orta.vscode-jest"
vscode "oscarcs.dart-syntax-highlighting-only"
vscode "oven.bun-vscode"
vscode "pandy.bun"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "rangav.vscode-thunder-client"
vscode "rduraj.expo-toolkit-push"
vscode "rebornix.ruby"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "riey.erb"
vscode "ritwickdey.liveserver"
vscode "roerohan.mongo-snippets-for-node-js"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "ryannaddy.laravel-artisan"
vscode "sdras.vue-vscode-snippets"
vscode "serayuzgur.crates"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "shufo.vscode-blade-formatter"
vscode "sianglim.slim"
vscode "sidibedev.expowhoami"
vscode "sidthesloth.html5-boilerplate"
vscode "smockle.xcode-default-theme"
vscode "solomonkinard.chrome-extension-api"
vscode "solomonkinard.chrome-extensions"
vscode "sorbet.sorbet-vscode-extension"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "sudoaugustin.tailpile"
vscode "sudoaugustin.tailwindcss-transpiler"
vscode "svelte.svelte-vscode"
vscode "swellaby.rust-pack"
vscode "tamasfe.even-better-toml"
vscode "tejanium.stimulusjs"
vscode "tgreen7.vs-code-node-require"
vscode "thomascsd.vscode-readme-pattern"
vscode "tobiah.unity-tools"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "trufflesuite-csi.truffle-vscode"
vscode "tushortz.python-extended-snippets"
vscode "vayan.haml"
vscode "vense.rails-snippets"
vscode "vercel.turbo-vsc"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vortizhe.simple-ruby-erb"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vsls-contrib.codetour"
vscode "vue.vscode-typescript-vue-plugin"
vscode "wholroyd.jinja"
vscode "willluke.nextjs"
vscode "wingrunr21.vscode-ruby"
vscode "wix.vscode-import-cost"
vscode "wscats.eno"
vscode "xabikos.javascriptsnippets"
vscode "xdebug.php-debug"
vscode "yclepticstudios.unity-snippets"
vscode "zaraclaj.dart-extensions-snippets"
vscode "zarifprogrammer.tailwind-snippets"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
vscode "zixuanchen.vitest-explorer"
vscode "zobo.php-intellisense"
